'''
Предложить структуру хранения данных и технологию их обработки для проекта интернет-магазина (упрощённо).
В магазине тысячи товаров различного предназначения, брендов и т.д.
В интернет-магазине необходимо предусмотреть систему скидок. Виды скидок:
• Скидка на единичный товар
• Скидка на бренд
• Скидка на группу товаров (группы: предназначение(техника, одежда,...), пол)
• Скидка клиента
Скидка имеет начало и конец действия. У каждого товара в
определённый момент может быть ни одной/одна/несколько скидок. Скидка в данный момент рассчитывается
как максимум из действующих скидок для товара. Скидку клиента учитывать в процессе покупки товара,
при отображении каталога товаров цены с учётом скидки клиента не пересчитывать. Остальные скидки при отображении
каталога должны быть показаны. Необходимо, чтобы была возможность сортировки товаров по актуальной цене - с учётом скидок.
• Какие django-приложения для решения задачи предлагаете использовать (готовые движки магазинов не предлагать)?
'''

'''
для
'''
